Revit 2024 API
FilledRegion.IsValidFilledRegionTypeId Method
 Indicates whether the given Id is a valid filled region type Id.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public static bool IsValidFilledRegionTypeId(
	Document document,
	ElementId typeId
)
Visual Basic
Public Shared Function IsValidFilledRegionTypeId ( _
	document As Document, _
	typeId As ElementId _
) As Boolean
Visual C++
public:
static bool IsValidFilledRegionTypeId(
	Document^ document,
	ElementId^ typeId
)
Parameters
document
Type: Autodesk.Revit.DB.Document
 The document.
typeId
Type: Autodesk.Revit.DB.ElementId
 The filled region type Id.
Return Value
 True if it is a valid filled region type Id, false otherwise.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
FilledRegion Class
Autodesk.Revit.DB Namespace